OpenFOAM-13/tutorials/incompressibleFluid/propeller/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            forces;
libs            ("libforces.so");

writeControl    timeStep;
timeInterval    1;

log             yes;

patches         ("propeller.*");

rho             rhoInf;     // Indicates incompressible
rhoInf          1;          // Redundant for incompressible
CofR            (0 0 0);    // Rotation around centre line of propeller
pitchAxis       (0 1 0);


// ************************************************************************* //
